#### Terraform Format and Style - prod 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.snampo_prod.module.project_services.google_project_service.project_services["apikeys.googleapis.com"]: Refreshing state... [id=snampo-prod/apikeys.googleapis.com]
module.snampo_prod.module.project_services.google_project_service.project_services["artifactregistry.googleapis.com"]: Refreshing state... [id=snampo-prod/artifactregistry.googleapis.com]
module.snampo_prod.module.project_services.google_project_service.project_services["street-view-image-backend.googleapis.com"]: Refreshing state... [id=snampo-prod/street-view-image-backend.googleapis.com]
module.snampo_prod.module.project_services.google_project_service.project_services["directions-backend.googleapis.com"]: Refreshing state... [id=snampo-prod/directions-backend.googleapis.com]
module.snampo_prod.module.project_services.google_project_service.project_services["storage.googleapis.com"]: Refreshing state... [id=snampo-prod/storage.googleapis.com]
module.snampo_prod.module.project_services.google_project_service.project_services["places.googleapis.com"]: Refreshing state... [id=snampo-prod/places.googleapis.com]
module.snampo_prod.module.project_services.google_project_service.project_services["maps-android-backend.googleapis.com"]: Refreshing state... [id=snampo-prod/maps-android-backend.googleapis.com]
module.snampo_prod.module.project_services.google_project_service.project_services["secretmanager.googleapis.com"]: Refreshing state... [id=snampo-prod/secretmanager.googleapis.com]
module.snampo_prod.module.project_services.google_project_service.project_services["run.googleapis.com"]: Refreshing state... [id=snampo-prod/run.googleapis.com]
module.snampo_prod.module.project_services.google_project_service.project_services["maps-ios-backend.googleapis.com"]: Refreshing state... [id=snampo-prod/maps-ios-backend.googleapis.com]
module.snampo_prod.module.project_services.google_project_service.project_services["maps-backend.googleapis.com"]: Refreshing state... [id=snampo-prod/maps-backend.googleapis.com]
module.snampo_prod.module.project_services.google_project_service.project_services["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=snampo-prod/cloudresourcemanager.googleapis.com]
module.snampo_prod.module.project_services.google_project_service.project_services["sts.googleapis.com"]: Refreshing state... [id=snampo-prod/sts.googleapis.com]
module.snampo_prod.module.service_account.google_service_account.service_accounts["snampo-prod-terraform"]: Refreshing state... [id=projects/snampo-prod/serviceAccounts/snampo-prod-terraform@snampo-prod.iam.gserviceaccount.com]
module.snampo_prod.module.service_account.google_service_account.service_accounts["snampo-prod-cicd"]: Refreshing state... [id=projects/snampo-prod/serviceAccounts/snampo-prod-cicd@snampo-prod.iam.gserviceaccount.com]
module.snampo_prod.module.google_api_keys.google_apikeys_key.basic_key["backend-api-key"]: Refreshing state... [id=projects/snampo-prod/locations/global/keys/backend-api-key]
module.snampo_prod.module.google_api_keys.google_apikeys_key.basic_key["frontend-api-key"]: Refreshing state... [id=projects/snampo-prod/locations/global/keys/frontend-api-key]
module.snampo_prod.module.service_account.google_service_account.service_accounts["snampo-prod-run"]: Refreshing state... [id=projects/snampo-prod/serviceAccounts/snampo-prod-run@snampo-prod.iam.gserviceaccount.com]
module.snampo_prod.module.gcs_buckets.google_storage_bucket.buckets["snampo-prod-bucket"]: Refreshing state... [id=snampo-prod-bucket]
module.snampo_prod.module.artifact_registry["snampo-prod"].google_artifact_registry_repository.repo: Refreshing state... [id=projects/snampo-prod/locations/asia-northeast1/repositories/snampo-prod]
module.snampo_prod.module.workload_identity.google_iam_workload_identity_pool.pool["github"]: Refreshing state... [id=projects/snampo-prod/locations/global/workloadIdentityPools/github]
module.snampo_prod.module.iam_members.google_project_iam_member.sa_members["snampo-prod-run@snampo-prod.iam.gserviceaccount.com:roles/secretmanager.secretAccessor"]: Refreshing state... [id=snampo-prod/roles/secretmanager.secretAccessor/serviceAccount:snampo-prod-run@snampo-prod.iam.gserviceaccount.com]
module.snampo_prod.module.iam_members.google_project_iam_member.group_members["gcp-organization-developers@nakamaware.com:roles/viewer"]: Refreshing state... [id=snampo-prod/roles/viewer/group:gcp-organization-developers@nakamaware.com]
module.snampo_prod.module.iam_members.google_project_iam_member.sa_members["snampo-prod-cicd@snampo-prod.iam.gserviceaccount.com:roles/artifactregistry.writer"]: Refreshing state... [id=snampo-prod/roles/artifactregistry.writer/serviceAccount:snampo-prod-cicd@snampo-prod.iam.gserviceaccount.com]
module.snampo_prod.module.iam_members.google_project_iam_member.sa_members["snampo-prod-terraform@snampo-prod.iam.gserviceaccount.com:roles/editor"]: Refreshing state... [id=snampo-prod/roles/editor/serviceAccount:snampo-prod-terraform@snampo-prod.iam.gserviceaccount.com]
module.snampo_prod.module.iam_members.google_project_iam_member.sa_members["snampo-prod-cicd@snampo-prod.iam.gserviceaccount.com:roles/run.developer"]: Refreshing state... [id=snampo-prod/roles/run.developer/serviceAccount:snampo-prod-cicd@snampo-prod.iam.gserviceaccount.com]
module.snampo_prod.module.iam_members.google_project_iam_member.sa_members["snampo-prod-terraform@snampo-prod.iam.gserviceaccount.com:roles/resourcemanager.projectIamAdmin"]: Refreshing state... [id=snampo-prod/roles/resourcemanager.projectIamAdmin/serviceAccount:snampo-prod-terraform@snampo-prod.iam.gserviceaccount.com]
module.snampo_prod.module.iam_members.google_project_iam_member.sa_members["snampo-prod-run@snampo-prod.iam.gserviceaccount.com:roles/logging.logWriter"]: Refreshing state... [id=snampo-prod/roles/logging.logWriter/serviceAccount:snampo-prod-run@snampo-prod.iam.gserviceaccount.com]
module.snampo_prod.module.iam_members.google_project_iam_member.sa_members["snampo-prod-cicd@snampo-prod.iam.gserviceaccount.com:roles/iam.serviceAccountUser"]: Refreshing state... [id=snampo-prod/roles/iam.serviceAccountUser/serviceAccount:snampo-prod-cicd@snampo-prod.iam.gserviceaccount.com]
module.snampo_prod.module.workload_identity.google_iam_workload_identity_pool_provider.gh_provider["nakamaware"]: Refreshing state... [id=projects/snampo-prod/locations/global/workloadIdentityPools/github/providers/nakamaware]
module.snampo_prod.module.workload_identity.google_service_account_iam_binding.sa_gh_binding["snampo-prod-terraform:roles/iam.serviceAccountTokenCreator"]: Refreshing state... [id=projects/snampo-prod/serviceAccounts/snampo-prod-terraform@snampo-prod.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator]
module.snampo_prod.module.workload_identity.google_service_account_iam_binding.sa_gh_binding["snampo-prod-cicd:roles/iam.serviceAccountTokenCreator"]: Refreshing state... [id=projects/snampo-prod/serviceAccounts/snampo-prod-cicd@snampo-prod.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator]
module.snampo_prod.module.workload_identity.google_service_account_iam_binding.sa_gh_binding["snampo-prod-terraform:roles/iam.workloadIdentityUser"]: Refreshing state... [id=projects/snampo-prod/serviceAccounts/snampo-prod-terraform@snampo-prod.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
module.snampo_prod.module.workload_identity.google_service_account_iam_binding.sa_gh_binding["snampo-prod-cicd:roles/iam.workloadIdentityUser"]: Refreshing state... [id=projects/snampo-prod/serviceAccounts/snampo-prod-cicd@snampo-prod.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
module.snampo_prod.module.secret_manager.google_secret_manager_secret.secrets["backend-api-key"]: Refreshing state... [id=projects/snampo-prod/secrets/backend-api-key]
module.snampo_prod.module.secret_manager.google_secret_manager_secret.secrets["frontend-api-key"]: Refreshing state... [id=projects/snampo-prod/secrets/frontend-api-key]
module.snampo_prod.module.secret_manager.google_secret_manager_secret_version.secret-version["frontend-api-key"]: Refreshing state... [id=projects/734767447284/secrets/frontend-api-key/versions/1]
module.snampo_prod.module.secret_manager.google_secret_manager_secret_version.secret-version["backend-api-key"]: Refreshing state... [id=projects/734767447284/secrets/backend-api-key/versions/1]
module.snampo_prod.module.cloud_run_service["snampo-prod-backend"].google_cloud_run_v2_service.default: Refreshing state... [id=projects/snampo-prod/locations/asia-northeast1/services/snampo-prod-backend]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.snampo_prod.module.google_api_keys.google_apikeys_key.basic_key["backend-api-key"] will be updated in-place
  ~ resource "google_apikeys_key" "basic_key" {
        id                    = "projects/snampo-prod/locations/global/keys/backend-api-key"
        name                  = "backend-api-key"
        # (5 unchanged attributes hidden)

      ~ restrictions {
          + api_targets {
              + service = "roads.googleapis.com"
            }

            # (3 unchanged blocks hidden)
        }
    }

  # module.snampo_prod.module.project_services.google_project_service.project_services["roads.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "snampo-prod"
      + service                    = "roads.googleapis.com"
    }

  # module.snampo_prod.module.workload_identity.data.google_service_account.service_account["snampo-prod-cicd"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_service_account" "service_account" {
      + account_id   = "snampo-prod-cicd"
      + disabled     = (known after apply)
      + display_name = (known after apply)
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "snampo-prod"
      + unique_id    = (known after apply)
    }

  # module.snampo_prod.module.workload_identity.data.google_service_account.service_account["snampo-prod-terraform"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_service_account" "service_account" {
      + account_id   = "snampo-prod-terraform"
      + disabled     = (known after apply)
      + display_name = (known after apply)
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "snampo-prod"
      + unique_id    = (known after apply)
    }

  # module.snampo_prod.module.workload_identity.google_service_account_iam_binding.sa_gh_binding["snampo-prod-cicd:roles/iam.serviceAccountTokenCreator"] must be replaced
-/+ resource "google_service_account_iam_binding" "sa_gh_binding" {
      ~ etag               = "BwZIRBSvsCA=" -> (known after apply)
      ~ id                 = "projects/snampo-prod/serviceAccounts/snampo-prod-cicd@snampo-prod.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator" -> (known after apply)
      ~ service_account_id = "projects/snampo-prod/serviceAccounts/snampo-prod-cicd@snampo-prod.iam.gserviceaccount.com" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.snampo_prod.module.workload_identity.google_service_account_iam_binding.sa_gh_binding["snampo-prod-cicd:roles/iam.workloadIdentityUser"] must be replaced
-/+ resource "google_service_account_iam_binding" "sa_gh_binding" {
      ~ etag               = "BwZIRBSvsCA=" -> (known after apply)
      ~ id                 = "projects/snampo-prod/serviceAccounts/snampo-prod-cicd@snampo-prod.iam.gserviceaccount.com/roles/iam.workloadIdentityUser" -> (known after apply)
      ~ service_account_id = "projects/snampo-prod/serviceAccounts/snampo-prod-cicd@snampo-prod.iam.gserviceaccount.com" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.snampo_prod.module.workload_identity.google_service_account_iam_binding.sa_gh_binding["snampo-prod-terraform:roles/iam.serviceAccountTokenCreator"] must be replaced
-/+ resource "google_service_account_iam_binding" "sa_gh_binding" {
      ~ etag               = "BwZIRBSv7dg=" -> (known after apply)
      ~ id                 = "projects/snampo-prod/serviceAccounts/snampo-prod-terraform@snampo-prod.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator" -> (known after apply)
      ~ service_account_id = "projects/snampo-prod/serviceAccounts/snampo-prod-terraform@snampo-prod.iam.gserviceaccount.com" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.snampo_prod.module.workload_identity.google_service_account_iam_binding.sa_gh_binding["snampo-prod-terraform:roles/iam.workloadIdentityUser"] must be replaced
-/+ resource "google_service_account_iam_binding" "sa_gh_binding" {
      ~ etag               = "BwZIRBSv7dg=" -> (known after apply)
      ~ id                 = "projects/snampo-prod/serviceAccounts/snampo-prod-terraform@snampo-prod.iam.gserviceaccount.com/roles/iam.workloadIdentityUser" -> (known after apply)
      ~ service_account_id = "projects/snampo-prod/serviceAccounts/snampo-prod-terraform@snampo-prod.iam.gserviceaccount.com" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 5 to add, 1 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @kawayama, Action: `pull_request`, Working Directory: `terraform/env/prod`, Workflow: `CI - Terraform`*